import GameCard from "../components/GameCard";

export default function Games() {
    return (
        <>
            <GameCard photo="https://coop-land.ru/uploads/posts/2019-11/1572936952_1.jpg"
                      link="red-dead-redemption-2"
                      name="Red dead redemption 2"
                      desc="Америка, 1899 год. Артур Морган и другие подручные Датча ван дер Линде вынуждены пуститься в бега. Их банде предстоит участвовать в кражах, грабежах и перестрелках в самом сердце Америки. За ними по пятам идут федеральные агенты и лучшие в стране охотники за головами, а саму банду разрывают внутренние противоречия. Артуру предстоит выбрать, что для него важнее: его собственные идеалы или же верность людям, которые его взрастили."
                      defaultPrice="2600" />

            <GameCard photo="https://s2.gaming-cdn.com/images/products/10936/orig/grand-theft-auto-v-xbox-series-x-s-xbox-series-x-s-game-microsoft-store-united-states-cover.jpg"
                      link="grand-theft-auto-5"
                      name="Grand Theft Auto 5"
                      desc="Лос-Сантос – город солнца, старлеток и вышедших в тираж звезд. Некогда предмет зависти всего западного мира, ныне это пристанище дрянных реалити-шоу, задыхающееся в тисках экономических проблем. В центре всей заварухи – троица совершенно разных преступников, отчаянно пытающихся ухватить удачу за хвост в непрекращающейся борьбе за место под солнцем. Бывший член уличной банды Франклин старается завязать с прошлым. Отошедший от дел грабитель банков Майкл обнаруживает, что в честной жизни все не так радужно, как представлялось. Повернутый на насилии псих Тревор перебивается от одного дельца к другому в надежде сорвать крупный куш. Исчерпав варианты, эти трое ставят на кон собственные жизни и учиняют серию дерзких ограблений, в которых – или пан, или пропал."
                      defaultPrice="2200" />
        </>
    )
}